const timetableData = [
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "48",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期三第9-10节{1-4周,6-7周}",
        "location": "计-13机房",
        "week": 3,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7]
      }]
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{7周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [7]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      [{
        "title": "程序设计综合实践",
        "period": "+3",
        "credit": "3",
        "time": "星期一第9-10节{1-3周,6-8周}",
        "location": "计-13机房",
        "week": 1,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8]
      }]
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{8周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [8]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }, {
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第3-4节{1-4周,6-9周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期二第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 2,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [{
        "title": "大数据时代的人工智能算法及其应用",
        "period": "32",
        "credit": "2.0",
        "time": "星期四第9-10节{1-4周,6-9周}",
        "location": "博5-C301",
        "week": 4,
        "start": 9,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9]
      }]
    ],
    [
      [{
        "title": "综合英语（3）",
        "period": "32",
        "credit": "2.0",
        "time": "星期五第1-2节{1-4周,6-7周,9周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期日第9-10节{9周}",
        "location": "博1-B101",
        "week": 7,
        "start": 9,
        "duration": 2,
        "weeks": [9]
      }]
    ]
  ],
  [
    [
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期一第3-4节{1-3周,6-10周}",
        "location": "博1-A103",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10]
      }, {
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      []
    ],
    [
      [],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第5-6节{1-4周,6-7周,9-10周}",
        "location": "博1-A103",
        "week": 5,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 9, 10]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第3-4节{1-4周,6-11周}",
        "location": "博1-A103",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期四第1-2节{1-4周,6-11周}",
        "location": "博2-B404",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11]
      }, {
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      [{
        "title": "电工技术与电子技术A(2)",
        "period": "56",
        "credit": "3.5",
        "time": "星期日第9-10节{11周}",
        "location": "博1-A103",
        "week": 7,
        "start": 9,
        "duration": 2,
        "weeks": [11]
      }]
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [{
        "title": "线性代数(16版，",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第5-6节{1-3周,6-12周}",
        "location": "博2-B404",
        "week": 1,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 6, 7, 8, 9, 10, 11, 12]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期二第5-6节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 2,
        "start": 5,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "毛泽东思想和中国特色社会主义理论体系概论",
        "period": "48",
        "credit": "3.0",
        "time": "星期四第7-8节{1-4周,6-13周}",
        "location": "博3-B103",
        "week": 4,
        "start": 7,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13]
      }],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期三第1-2节{1-4周,6-15周}",
        "location": "博1-A401",
        "week": 3,
        "start": 1,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [{
        "title": "大学物理B（2）",
        "period": "56",
        "credit": "3.5",
        "time": "星期五第3-4节{1-4周,6-8周(双),9-15周}",
        "location": "博1-A401",
        "week": 5,
        "start": 3,
        "duration": 2,
        "weeks": [1, 2, 3, 4, 6, 8, 9, 10, 11, 12, 13, 14, 15]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{16周}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [16]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [],
      [{
        "title": "计算机组成原理实验",
        "period": "16",
        "credit": "0.5",
        "time": "星期五第5-8节{16-19周}",
        "location": "计-37机房",
        "week": 5,
        "start": 5,
        "duration": 4,
        "weeks": [16, 17, 18, 19]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期二第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 2,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [{
        "title": "高级语言程序设计",
        "period": "56",
        "credit": "3.5",
        "time": "星期四第1-2节{3-4周,6-17周}",
        "location": "博2-B102",
        "week": 4,
        "start": 1,
        "duration": 2,
        "weeks": [3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      [{
        "title": "篮球(3)",
        "period": "24",
        "credit": "0.5",
        "time": "星期四第5-6节{6-17周}",
        "location": "未排地点",
        "week": 4,
        "start": 5,
        "duration": 2,
        "weeks": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
      }],
      [],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [],
      [{
        "title": "计算机组成原理实验",
        "period": "16",
        "credit": "0.5",
        "time": "星期五第5-8节{16-19周}",
        "location": "计-37机房",
        "week": 5,
        "start": 5,
        "duration": 4,
        "weeks": [16, 17, 18, 19]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [{
        "title": "高级语言程序设计实验",
        "period": "32",
        "credit": "1.0",
        "time": "星期三第5-8节{7-9周,11-17周(单),18周}",
        "location": "计-11机房",
        "week": 3,
        "start": 5,
        "duration": 4,
        "weeks": [7, 8, 9, 11, 13, 15, 17, 18]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期五第1-2节{11-18周}",
        "location": "博5-B401",
        "week": 5,
        "start": 1,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 16, 17, 18]
      }],
      [],
      [{
        "title": "计算机组成原理实验",
        "period": "16",
        "credit": "0.5",
        "time": "星期五第5-8节{16-19周}",
        "location": "计-37机房",
        "week": 5,
        "start": 5,
        "duration": 4,
        "weeks": [16, 17, 18, 19]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期一第3-4节{9-17周,19周}",
        "location": "博2-B302",
        "week": 1,
        "start": 3,
        "duration": 2,
        "weeks": [9, 10, 11, 12, 13, 14, 15, 16, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [{
        "title": "英语实践（3）",
        "period": "32",
        "credit": "1.0",
        "time": "星期二第3-4节{11-15周,17-19周(单)}",
        "location": "博5-B401",
        "week": 2,
        "start": 3,
        "duration": 2,
        "weeks": [11, 12, 13, 14, 15, 17, 19]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [{
        "title": "计算机组成原理",
        "period": "40",
        "credit": "2.5",
        "time": "星期三第3-4节{10-19周}",
        "location": "博2-B302",
        "week": 3,
        "start": 3,
        "duration": 2,
        "weeks": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
      }],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [{
        "title": "计算机组成原理实验",
        "period": "16",
        "credit": "0.5",
        "time": "星期五第5-8节{16-19周}",
        "location": "计-37机房",
        "week": 5,
        "start": 5,
        "duration": 4,
        "weeks": [16, 17, 18, 19]
      }],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ],
  [
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ],
    [
      [],
      [],
      [],
      [],
      []
    ]
  ]
]

export {
  timetableData
};